{
    "definition": {
        "method": "scheduleAdjustment", 
        "names": {
            "input": [
                "scheduledTimes", 
                "arrivalTimes"
            ]
        }, 
        "types": {
            "output": "int", 
            "input": [
                "int[]", 
                "int[]"
            ]
        }, 
        "class": "WizardsAppointments"
    }, 
    "tests": [], 
    "name": "WizardsAppointments", 
    "statement": "<td class=\"statText\">Several wizards have scheduled appointments to meet with non-wizards.  Each wizard will have exactly one meeting with a non-wizard.  Unfortunately, some of the wizards have just realized that they will not be able to arrive at their meetings on time.  They will show up either too early or too late.\n<br />\nIn an attempt to minimize the total waiting time, the wizards have decided to reschedule all of the meetings by shifting each one by the same amount of time.  The total waiting time includes the time spent by wizards waiting for non-wizards to show up and the time spent by non-wizards waiting for wizards to show up.  The non-wizards will all arrive exactly on time to the rescheduled meetings.\n<br />\nYou are given int[]s <b>scheduledTimes</b> and <b>arrivalTimes</b>.  The i-th element of <b>scheduledTimes</b> is the original scheduled starting time for the i-th wizard's meeting.  The i-th element of <b>arrivalTimes</b> is the time when the i-th wizard will show up to his meeting.  All times are given in hours.  If you shift all the meetings by T hours, the total waiting time can be calculated as the sum of abs(<b>scheduledTimes</b>[i] + T - <b>arrivalTimes</b>[i]) over all the meetings.  \n\nReturn the number of distinct integer shifts which allow to minimize the total waiting time.</td>", 
    "constraints": [
        "<td class=\"statText\"><b>scheduledTimes</b> will contain between 1 and 50 elements, inclusive.</td>", 
        "<td class=\"statText\"><b>arrivalTimes</b> will contain the same number of elements as <b>scheduledTimes</b>.</td>", 
        "<td class=\"statText\">Each element of <b>scheduledTimes</b> will be between 1 and 10<sup>9</sup>, inclusive.</td>", 
        "<td class=\"statText\">Each element of <b>arrivalTimes</b> will be between 1 and 10<sup>9</sup>, inclusive.</td>"
    ], 
    "number": 10255, 
    "examples": [
        {
            "comment": "<td class=\"statText\"><table><tr><td colspan=\"2\" class=\"statText\">The wizard will arrive at his meeting 1 hour earlier than the scheduled time. If the meeting is shifted 1 hour earlier, the total waiting time will be 0.</td></tr></table></td>", 
            "input": [
                [
                    10
                ], 
                [
                    9
                ]
            ], 
            "output": 1
        }, 
        {
            "comment": "<td class=\"statText\"><table><tr><td colspan=\"2\" class=\"statText\">Both wizards arrive too early, one of them being 2 hours early and the second one being 5 hours early. Every shift between -5 and -2 hours makes the total waiting time equal to 3 hours.</td></tr></table></td>", 
            "input": [
                [
                    20, 
                    30
                ], 
                [
                    18, 
                    25
                ]
            ], 
            "output": 4
        }, 
        {
            "comment": "<td class=\"statText\"><table><tr><td colspan=\"2\" class=\"statText\">This time, one wizard is late by 1 hour and the other is early by 3 hours. Every shift between -3 hours and 1 hour makes the total waiting time equal to 4 hours.</td></tr></table></td>", 
            "input": [
                [
                    10, 
                    20
                ], 
                [
                    11, 
                    17
                ]
            ], 
            "output": 5
        }, 
        {
            "comment": "<td class=\"statText\"><table><tr><td colspan=\"2\" class=\"statText\">Of the three wizards, one is 5 hours early and two are 3 and 4 hours late. After a 3 hour shift, one wizard comes in time, one is 8 hours early, and one is 1 hour late.</td></tr></table></td>", 
            "input": [
                [
                    10, 
                    20, 
                    30
                ], 
                [
                    13, 
                    15, 
                    34
                ]
            ], 
            "output": 1
        }, 
        {
            "comment": "", 
            "input": [
                [
                    10, 
                    20, 
                    30, 
                    40
                ], 
                [
                    14, 
                    24, 
                    39, 
                    37
                ]
            ], 
            "output": 1
        }
    ]
}